Revit 2027 API
EmbodiedCarbonAsset.ProviderName Property
 User visible name of provider. List of available providers can be retrieved from Sustainability API.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ProviderName { get; }
Public ReadOnly Property ProviderName As String
	Get
public:
property String^ ProviderName {
	String^ get ();
}
member ProviderName : string with get
Property Value
String
See Also
Reference
EmbodiedCarbonAsset Class
Autodesk.Revit.DB Namespace